[A_Stranglehold_Buff H7BaseBuff]
mName="束缚压制"
mTooltip="该生物在使用束缚压制生物的回合开始前或两者位置不再相邻前无法移动。"

[A_HexOfDisruption_Buff H7BaseBuff]
mName="解离大法"
mTooltip="%stat %ICON_DEFENSE 防御\n持续 %durnow 回合。"

[A_Nimble_Buff H7BaseBuff]
mName="身形灵动"

[A_Incapacitated_Immunity_Buff H7BaseBuff]
mName="免疫失能"
mTooltip="该生物不受失能影响，持续 %durnow 战斗回合。"

[A_NightmarishPresence H7CreatureAbility]
mName="噩梦降临"
mTooltip="相邻敌方生物 %buff1.buff.stat %ICON_MORALE 士气。"

[A_Indomitable H7CreatureAbility]
mName="不屈不挠"
mTooltip="该生物对负面精神效果免疫：免疫 %ICON_MORALE 降低士气和催眠效果，并在受到攻击时免疫"恐惧代言"效果。"

[A_AuraOfPurity H7CreatureAbility]
mName="净涤之光"
mTooltip="该生物和相邻本方生物免受负面魔法效果。"

[A_RuneTeleport H7CreatureAbility]
mName="符文传送"
mTooltip="该生物传送到一个友方符文的位置。若符文被摧毁，则该生物在战斗结束前会获得符文的光环技能。"

[A_MagmaBlood H7CreatureAbility]
mName="岩浆血统"
mTooltip="该生物无法成为负面火系法术或效果的目标，敌人造成的火焰伤害最多杀死一个该生物组队的生物。"

[A_Regeneration_Dragon H7CreatureAbility]
mName="活力再生"
mTooltip="该生物在回合结束时回复 %d.min 生命值。"

[A_PiercingShot H7CreatureAbility]
mName="穿刺射击"
mTooltip="该生物将攻击成一条直线上的所有单位。"

[A_Wild H7CreatureAbility]
mName="狂野本性"
mTooltip="每当该生物受到敌方生物的近战攻击（不含反击）时，它获得两次攻击并对敌方造成无法行动的暴击，持续到下回合结束。"

[A_AcidSpit H7CreatureAbility]
mName="酸液喷涂"
mTooltip="受打击的生物下回合遭受该伤害值的50%，再下回合继续遭受25%。"

[A_ResistanceWater H7CreatureAbility]
mName="水系抗性"
mTooltip="水系法术的伤害和负面效果减半，敌人造成的水系攻击伤害减少25%。"

[A_EntanglingRoots H7CreatureAbility]
mName="根须缠绕"
mTooltip="受树精击打生物无法移动或使用移动能力，直到树精移动后解除。"

[A_AcidBreath_Buff H7BaseBuff]
mName="酸性吐息"
mTooltip="该生物在回合开始时受到 %special1.val1 %ICON_EARTH 土系伤害，该伤害每回合递减一半，持续 %durnow 回合。"

[A_Defensive H7CreatureAbility]
mName="防守姿态"
mTooltip="当该生物开启防御姿态时，他将有无限的反击机会，且无法在其回合中被侧击。"

[A_FireShield H7CreatureAbility]
mName="烈火护盾"
mTooltip="近战攻击或反击的敌方生物受到攻击伤害 %special1 的火焰伤害。"

[A_Thorns_Buff H7BaseBuff]
mName="荆棘遍地"
mTooltip="%stat %ICON_MOVEMENT 移动力\n生物移动时受到 %d.min %ICON_EARTH土系伤害。\n持续到回合结束。"

[A_Wild_Buff H7BaseBuff]
mName="狂野本性"
mTooltip="该生物必定攻击两次，受攻击的生物在被首次攻击后有反击机会。该生物造成的暴击无法反击，且使被攻击的生物在下回合结束前无法行动。"

[A_AuraOfFire_Buff H7BaseBuff]
mName="火焰光环"
mTooltip="该生物免疫水系魔法效果。"

[A_Sweep H7CreatureAbility]
mName="横扫"
mTooltip="该生物攻击目标单位一定角度内所有相邻敌军。"

[A_Petrification H7CreatureAbility]
mName="石化攻击"
mTooltip="被暴击的生物将无法行动，直到下回合结束或受到伤害。"

[A_CorrodingVenom_Buff H7BaseBuff]
mName="腐蚀毒药"
mTooltip="%stat %icon_defense 防御，持续到该生物下回合结束。"

[A_Maneuver H7CreatureAbility]
mName="灵活机动"
mTooltip="当受到近战攻击触发反击时，该生物将离开进攻单位并发动一次远程攻击。"

[A_PiercingClaws H7CreatureAbility]
mName="破甲利爪"
mTooltip="该生物的攻击忽略目标生物 %ICON_DEFENSE 防御。"

[A_EntanglingRoots_Buff H7BaseBuff]
mName="根须缠绕"
mTooltip="该生物无法移动或使用移动能力。"

[A_AuraOfLight_Buff H7BaseBuff]
mName="神圣之光"
mTooltip="该生物免疫暗系魔法。"

[A_LeafDaggers H7CreatureAbility]
mName="柳叶短剑"
mTooltip="该生物每次战斗能执行一次 %ICON_RANGE 全程射击，该射击忽略 %ICON_DEFENSE 防御和掩体。"

[A_ResistanceLight H7CreatureAbility]
mName="光系抗性"
mTooltip="光系法术的伤害和负面效果减半，敌人造成的光系攻击伤害减少25%。"

[A_NightmarishPresence_Buff H7BaseBuff]
mName="噩梦降临"
mTooltip="%stat %ICON_MORALE 士气"

[A_MightyPounce H7CreatureAbility]
mName="凶猛突袭"
mTooltip="每次战斗可发动一次，该生物移动距离翻倍并能对所有相邻目标造成默认伤害，且不会触发反击。"

[A_Rage_Buff H7BaseBuff]
mName="怒气勃发"
mTooltip="%stat1 伤害和 %stat3 %icon_movement 移动力。该生物对负面心灵效果免疫（免疫 %ICON_MORALE 士气降低和催眠大法，并在受到攻击时无视恐惧代言效果），持续到该生物下回合结束。"

[A_Mesmerize H7CreatureAbility]
mName="催眠大法"
mTooltip="发动暴击时，目标生物无法行动，持续到其受到伤害或下回合结束。"

[A_NoRetaliation_Buff H7BaseBuff]
mName="丧失反击"

[A_Backstab H7CreatureAbility]
mName="背后偷袭"
mTooltip="该生物的全力侧击效果提高50%。"

[A_ImmunityPrime H7CreatureAbility]
mName="源力免疫"
mTooltip="该生物无法被指定为负面源力法术或负面源力效果的目标，受敌方源力攻击的伤害减半。"

[A_FeralCharge_Buff H7BaseBuff]
mName="野性冲锋"

[A_ImmunityDarkness H7CreatureAbility]
mName="暗系免疫"
mTooltip="该生物无法被指定为负面暗系法术或负面暗系效果的目标，受敌方暗系攻击的伤害减半。"

[A_ChaosShield H7CreatureAbility]
mName="混沌护甲"
mTooltip="每次近战攻击及反击时使敌方生物遭受随机的负面魔法效果。"

[A_HammerOfArkath H7CreatureAbility]
mName="火龙之锤"
mTooltip="在该生物近战攻击（非反击）目标的所有生物和战争单位受到其造成伤害 %special1 的火焰伤害。"

[A_SeaWarfare H7CreatureAbility]
mName="海战"
mTooltip="在船上作战时，该生物获得\n%buff.buff.stat6 基础伤害，%buff.buff.stat2 生命值\n%buff.buff.stat4 %ICON_ATTACK 攻击，%buff.buff.stat5 %ICON_DEFENSE 防御力\n%buff.buff.stat8 %ICON_MORALE 士气，%buff.buff.stat9 %ICON_LUCK 幸运\n%buff.buff.stat3 %ICON_INITIATIVE 主动性，%buff.buff.stat1 %ICON_MAX_MOVEMENT 移动力。"

[A_FatalStrike H7CreatureAbility]
mName="夺命一击"
mTooltip="只要能造成一点伤害，该生物就能至少消灭一个敌方生物。"

[A_WhirlingDeath H7CreatureAbility]
mName="旋转死神"
mTooltip="该生物能攻击相邻所有目标。"

[A_ThrowingHammer_Buff H7BaseBuff]
mName="掷锤猛击"

[A_HeartOfDarkness H7CreatureAbility]
mName="黑暗之心"
mTooltip="该生物和相邻本方生物获得光系魔法抗性，且附近敌人将获得暗系易伤。"

[A_Regeneration_ShantiriTitan H7CreatureAbility]
mName="活力再生"
mTooltip="该生物在回合结束时回复 %d.min 生命值。"

[A_MagmaPond_Buff H7BaseBuff]
mName="岩浆之池"

[A_ImplodingArrow H7CreatureAbility]
mName="聚爆箭矢"
mTooltip="该生物对目标施展远程攻击，所有距离目标生物三格内的生物会被拉向目标生物，每回合一次。"

[A_TrailOfFire H7CreatureAbility]
mName="烈火印记"
mTooltip="该生物在移动到目标地点或攻击目标生物时，会在行动路径上留下烈火印记。进入或回合开始位于轨迹上的生物将受到 %buff1.buff.d1.min %icon_fire 火焰伤害，该轨迹持续到下个战斗回合。"

[A_PreemptiveStrike H7CreatureAbility]
mName="先制反击"
mTooltip="该生物会在受到攻击前发动反击。"

[A_RangedRetaliation H7CreatureAbility]
mName="远程反击"
mTooltip="该生物受到非近战攻击时能在自己的射程范围内进行反击。"

[A_HeartOfDarkness_Buff_Vulnerability H7BaseBuff]
mName="黑暗之心"
mTooltip="暗系易伤：该生物受到的暗系伤害增加25%。"

[A_Unfettered H7CreatureAbility]
mName="挣脱桎梏"
mTooltip="该生物免疫所有类型的移动限制。"

[A_VulnerabilityAir H7CreatureAbility]
mName="气系易伤"
mTooltip="该生物额外承受 %res 气系伤害。"

[A_ArmourPiercing H7CreatureAbility]
mName="铠甲穿刺"
mTooltip="该生物的远程攻击将忽略目标单位的 %ICON_DEFENSE 防御。"

[A_RavangerCharge H7CreatureAbility]
mName="冲锋"
mTooltip="攻击目标前每行进一格，该生物+2 %ICON_ATTACK 攻击。"

[A_ResistanceEarth H7CreatureAbility]
mName="土系抗性"
mTooltip="土系法术的伤害和负面效果减半，敌人造成的土系攻击伤害减少25%。"

[A_Rage H7CreatureAbility]
mName="怒气勃发"
mTooltip="每当该生物遭受一个敌方生物远程攻击时，获得 %buff.buff.stat1 伤害与 %buff.buff.stat3 %icon_movement 移动力，并且对负面心灵效果免疫，持续到其下回合结束。"

[A_InkSpray_Buff H7BaseBuff]
mName="墨汁挥溅"
mTooltip="所有近战攻击50%的机会错失目标，持续直到该生物回合结束。"

[A_Shielding_Buff H7BaseBuff]
mName="盾防御"
mTooltip="生物仅受到25%的近战或远程攻击伤害。"

[A_MagicImmunity H7CreatureAbility]
mName="魔法免疫"
mTooltip="该生物免受所有负面法术和影响，受到所有敌方魔法攻击的伤害减半。"

[A_MagmaPond H7CreatureAbility]
mName="岩浆之池"
mTooltip="在该生物位置创建一个 4x4 的岩浆池，持续到下回合。进入或在岩浆池上开始回合的生物受到 %buff1.buff.d1.min %icon_fire 火焰伤害。"

[A_Vigilance H7CreatureAbility]
mName="警戒"
mTooltip="该生物不会受到侧击。"

[A_AuraOfFire H7CreatureAbility]
mName="火焰光环"
mTooltip="该生物与相邻的本方生物免疫水系魔法效果。"

[A_CripplingSting_Buff H7BaseBuff]
mName="致残之刺"

[A_InspiringPresence_Buff H7BaseBuff]
mName="振奋军心"
mTooltip="%stat2 %ICON_MORALE 士气\n%stat1 %ICON_LUCK 幸运"

[A_OpportunityAttack_Buff H7BaseBuff]
mName="几率攻击增益"

[A_ImmunityEarth H7CreatureAbility]
mName="土系免疫"
mTooltip="该生物无法被指定为负面土系法术或负面土系效果的目标，受敌方土系攻击的伤害减半。"

[A_HeartOfDarkness_Buff_Resistance H7BaseBuff]
mName="黑暗之心"
mTooltip="光系魔法抗性：受到光系法术伤害减少50%，受到生物造成的光系伤害减少25%。"

[A_VulnerabilityEarth H7CreatureAbility]
mName="土系易伤"
mTooltip="该生物额外承受 %res 土系伤害。"

[A_AuraOfCleansing H7CreatureAbility]
mName="净化之光"
mTooltip="该生物及相邻的本方生物获得%buff1.buff.stat %ICON_DEFENSE 防御力，并在受影响的生物回合开始时随机消除一个负面魔法效果。"

[A_FeralCharge H7CreatureAbility]
mName="野性冲锋"
mTooltip="该生物对目标单位发起的进攻不受移动范围限制且不受反击，进攻 %buff1.buff.stat2 %ICON_ATTACK 攻击，但其 %ICON_DEFENSE 防御力减少至 %buff4.buff.stat.norm ，持续到下一回合。\n每次战斗只能触发一次。"

[A_ResistanceFire H7CreatureAbility]
mName="火系抗性"
mTooltip="火系法术的伤害和负面效果减半，敌人造成的火系攻击伤害减少25%。"

[A_Blind H7CreatureAbility]
mName="失明"
mTooltip="该生物天生无法视物，因此免受致盲效果。"

[A_VulnerabilityWater H7CreatureAbility]
mName="水系易伤"
mTooltip="该生物额外承受 %res 水系伤害。"

[A_Bash H7CreatureAbility]
mName="迎头重击"
mTooltip="该单位的暴击不受反击，并且能使目标生物丧失行动能力直到下回合结束。"

[A_SixHeaded H7CreatureAbility]
mName="六头齐袭"
mTooltip="该生物能以极大的角度同时攻击所有相邻的敌方生物。"

[A_FireBreath_Buff H7BaseBuff]
mName="烈焰吐息"

[A_AuraOfLight H7CreatureAbility]
mName="神圣之光"
mTooltip="该生物及相邻本方生物免疫暗系魔法。"

[A_InspiringPresence H7CreatureAbility]
mName="振奋军心"
mTooltip="该生物和相邻本方生物获得 %buff1.buff.stat1 %ICON_MORALE 士气和 %ICON_LUCK 幸运。"

[A_ImmunityFire H7CreatureAbility]
mName="火系免疫"
mTooltip="该生物无法被指定为负面火系法术或负面火系效果的目标，受敌方火系攻击的伤害减半。"

[A_ForceArrows H7CreatureAbility]
mName="强力箭矢"
mTooltip="该生物的远程攻击无视目标生物 %special1.val1 %icon_defense 防御。"

[A_Rebirth_Firebird H7CreatureAbility]
mName="重获新生"
mTooltip="每场战斗中第一次该生物被完全消灭时，将会以原先数量的一半重生，且移除所有效果。"

[A_LongRange H7CreatureAbility]
mName="长程攻击"
mTooltip="小型生物无法对该生物的攻击发动反击。"

[A_FeralCharge_Buff_Penalty H7BaseBuff]
mName="野性冲锋"
mTooltip="该生物 %ICON_DEFENSE 防御减少至 %stat.norm 。\n持续 %durnow 回合。"

[A_ManaDrain H7CreatureAbility]
mName="法力汲取"
mTooltip="每消灭一个生物，该生物就能从敌方汲取1点法力，并输送给本方英雄。"

[A_NoRetaliation H7CreatureAbility]
mName="不受反击"
mTooltip="敌方生物无法反击该生物的进攻。"

[A_TrailOfFire_Buff H7BaseBuff]
mName="烈火印记"

[A_MobileShooter H7CreatureAbility]
mName="移动射击"
mTooltip="该生物可以先移动再进行攻击，也可以先攻击再移动。"

[A_Nimble H7CreatureAbility]
mName="身形灵动"
mTooltip="该生物被大型生物攻击或反击时 %buff1.buff.stat1 %icon_defense 防御力，该生物无法被大型生物侧击。"

[A_TreantSynergy H7CreatureAbility]
mName="树精共鸣"
mTooltip="该生物和相邻生物获得 %buff.buff.stat %ICON_DEFENSE 防御力。\n回合结束时，该生物回复相邻本方树精 %d.min 生命值。"

[A_CorrodingVenom H7CreatureAbility]
mName="腐蚀毒药"
mTooltip="该生物所攻击的目标（不含反击） %buff.buff.stat %icon_defense 防御，持续到目标下回合结束。"

[A_PoisonedBlades_Buff H7BaseBuff]
mName="剧毒之刃"
mTooltip="生物在回合开始时受到 %special.val1 %ICON_DARK 暗系魔法伤害。该伤害每回合按照初始伤害增加，持续 %durnow 回合。"

[A_AuraOfCleansing_Buff H7BaseBuff]
mName="净化之光"
mTooltip="%stat %ICON_DEFENSE 防御\n该生物回合开始时将清除一个随机的负面魔法效果。"

[A_PoisonedBlades H7CreatureAbility]
mName="剧毒之刃"
mTooltip="每个幽影对被攻击的生物在回合开始时造成 %buff.buff.special.val2 %ICON_DARK 暗系伤害，并在每回合增加 %buff.buff.special.val2 伤害，持续 %buff.buff.durini 回合。"

[A_WitheringBreath_Buff H7BaseBuff]
mName="虚枯吐息"
mTooltip="该生物本回开始受 %special1.val1 %ICON_DARK 暗系魔法伤害，该伤害每回合减半，持续 %durnow 回合。"

[A_VulnerabilityFire H7CreatureAbility]
mName="火系易伤"
mTooltip="该生物额外承受 %res 火系伤害。"

[A_Construct H7CreatureAbility]
mName="构造体"
mTooltip="该生物免疫中毒、致盲、精神控制效果和士气效果。但无法被治疗或复活。"

[A_Resurrection H7CreatureAbility]
mName="转世重生"
mTooltip="立即治疗或复活本方生物 %d.min 生命值。\n每个战斗回合一次。\n（亡灵体和构造体不受影响）"

[A_ImmunityAir H7CreatureAbility]
mName="气系免疫"
mTooltip="该生物无法被指定为负面气系法术或负面气系效果的目标，受敌方气系攻击的伤害减半。"

[A_WitheringVenom_Buff H7BaseBuff]
mName="凋零毒液"
mTooltip="该生物在回合开始受到 %special %ICON_DARK 暗系伤害，该伤害每回合增加，持续 %durnow 回合。"

[A_ImmunityLight H7CreatureAbility]
mName="光系免疫"
mTooltip="该生物无法被指定为负面光系法术或负面光系效果的目标，受敌方光系攻击的伤害减半。"

[A_SweepingBash H7CreatureAbility]
mName="迎头痛击"
mTooltip="该生物攻击较小角度内的所有相邻敌方生物，被暴击的生物失去行动能力，直到下回合开始。"

[A_SeaWarfare_Buff H7BaseBuff]
mName="海战"

[A_UnlimitedRetaliations H7CreatureAbility]
mName="无限反击"
mTooltip="该生物总会对对手发动反击。"

[A_DwarvenShieldwall H7CreatureAbility]
mName="矮人盾墙"
mTooltip="非侧击伤害 %special1.val1 %icon_defense 防御，非侧击伤害与反击无法使该生物丧失行动力。"

[A_BlindingLight H7CreatureAbility]
mName="致盲闪光"
mTooltip="受到该生物暴击的目标无法行动，直到其下回合结束。"

[A_WitheringVenom H7CreatureAbility]
mName="凋零毒液"
mTooltip="每个织死蜘蛛能在每回合开始时对被攻击生物额外造成 %buff.buff.special.val2 %ICON_DARK 暗系伤害，后续每回合增加 %buff.buff.special.val2伤害，持续 %buff.buff.durini 回合。"

[A_FieryEye H7CreatureAbility]
mName="炽热之眼"
mTooltip="该生物的全程射击将附带 %d.min 至 %d.max %ICON_FIRE 火系伤害。"

[A_Undead H7CreatureAbility]
mName="亡灵体"
mTooltip="该生物既没有生命也没有士气。\n它不能被治疗或复活。\n它免疫中毒、精神控制和恐惧。\n它将额外受到 %res2.norm 光系伤害，并免疫正面光系法术和增益效果。"

[A_MightyPounce_Buff H7BaseBuff]
mName="凶猛突袭"
mTooltip="移动距离翻倍并移除攻击动作"

[A_MagicAbsorption H7CreatureAbility]
mName="魔力吸收"
mTooltip="只要受到法术伤害，该生物下回合攻击将额外造成 %ICON_PRIME 源力伤害，增加的伤害值决定于队伍生物的数量乘以它们的基础攻击伤害。"

[A_Charge H7CreatureAbility]
mName="冲锋"
mTooltip="攻击目标前每行进一格，该生物+2 %ICON_ATTACK 攻击。"

[A_MagicTouch H7CreatureAbility]
mName="魔力之触"
mTooltip="被攻击目标将受到一个随机负面魔法影响。"

[A_Incapacitated_Buff H7BaseBuff]
mName="无法行动"
mTooltip="该生物无法行动或反击，直到战斗回合结束。\n该生物在后两个战斗回合中免疫失能效果。"

[A_VulnerabilityLight H7CreatureAbility]
mName="光系易伤"
mTooltip="该生物额外承受 %res 光系伤害。"

[A_Stranglehold H7CreatureAbility]
mName="束缚压制"
mTooltip="被该生物攻击或反击的小型单位将因束缚压制效果在下回合开始前无法移动，除非其死亡或被迫移动。"

[A_AuraOfPurity_Buff H7BaseBuff]
mName="净涤之光"
mTooltip="该生物免受负面魔法效果。"

[A_ArcaneWings H7CreatureAbility]
mName="奥术双翼"
mTooltip="该生物的回合结束时，所有相邻的敌方生物将受到一个随机的魔法效果。"

[A_VulnerabilityDarkness H7CreatureAbility]
mName="暗系易伤"
mTooltip="该生物额外承受 %res 暗系伤害。"

[A_TreantSynergy_Buff H7BaseBuff]
mName="树精共鸣"
mTooltip="%stat %ICON_DEFENSE 防御力"

[A_ResistanceAir H7CreatureAbility]
mName="气系抗性"
mTooltip="气系法术的伤害和负面效果减半，敌人造成的气系攻击伤害减少25%。"

[A_MobileShooter_Skip_Ability H7CreatureAbility]
mName="结束回合"
mTooltip="结束该生物的回合"

[A_Defensive_Buff H7BaseBuff]
mName="防守姿态"
mTooltip="该生物有无限的反击机会，且无法在其下回合前被侧击。"

[A_ImmunityWater H7CreatureAbility]
mName="水系免疫"
mTooltip="该生物无法被指定为负面水系法术或负面水系效果的目标，受敌方水系攻击的伤害减半。"

[A_ThrowingHammer H7CreatureAbility]
mName="掷锤猛击"
mTooltip="该生物施展一次 %buff1.buff.stat1 %icon_attack 攻击的全程射击攻击，每次战斗只可使用一次。但每当该生物组队死亡时即可再次使用。"

[A_LifeDrain_InsatiableThirst H7CreatureAbility]
mName="生命汲取"
mTooltip="该生物的攻击能回复等于此次伤害值75%的生命值，该回复也可以复活已经阵亡的生物。"

[A_OpportunityRetaliation_Buff H7BaseBuff]
mName="伺机反击"
mTooltip="该生物可以和相邻本方生物一起发动反击。"

[A_RuneOfBalance_Rune H7EditorRuneUnit]
mName="平衡符文"

[A_Soulfire H7CreatureAbility]
mName="灵魂之火"
mTooltip="邻近生物获得 %buff1.buff.stat1 %icon_morale 士气和 %buff1.buff.stat3 %icon_movement 移动力（即便只是路过该生物）。"

[A_Soulfire_Buff H7BaseBuff]
mName="炽焰灵魂"
mTooltip="%stat1 %icon_morale 士气和 %stat3 %icon_movement 移动力，持续到该生物下回合结束。"

[A_AcidSpit_Buff H7BaseBuff]
mName="酸液喷涂"
mTooltip="该生物在回合开始时受到 %special1.val1 %ICON_EARTH 土系伤害.。这个伤害每回合递减一半，持续%durnow回合。"

[A_ResistanceDarkness H7CreatureAbility]
mName="暗系抗性"
mTooltip="暗系法术的伤害和负面效果减半，敌人造成的暗系攻击伤害减少25%。"

[A_DoubleShot H7CreatureAbility]
mName="二次射击"
mTooltip="该生物如果在第一次远程攻击中消灭了至少一个生物，那它可以发动第二次打击。受到攻击的生物在第一次被打击后有机会发动反击。"

[A_Cleave_Buff_Penalty H7BaseBuff]
mName="顺势斩惩罚"
mTooltip="持续时间：%t"
[A_Charge_Buff H7BaseBuff]
mName="冲锋"
[A_DoubleShot_Buff_Penalty H7BaseBuff]
mName="二次射击惩罚"
mTooltip="持续时间：%t"
[A_DragonAcidBreath_Buff H7BaseBuff]
mName="酸性龙息"
mTooltip="该生物组队将立即受到一次伤害。"
[A_MagicAbsorption_Buff H7BaseBuff]
mName="魔力吸收"
mTooltip="该生物下回合的攻击将额外造成 %ICON_PRIME 源力伤害。"
[A_Mesmerize_Buff H7BaseBuff]
mName="催眠大法"
mTooltip="目标生物直到下回合结束或受到伤害前无法移动。"
[A_PiercingClaws_Buff H7BaseBuff]
mName="破甲利爪"
[A_Stunned_Buff H7BaseBuff]
mName="击晕"
mTooltip="该生物受到强大的特殊技能影响而在该回合无法行动。"
[A_Petrification_Buff H7BaseBuff]
mName="石化"
mTooltip="该生物无法发动反击且无法行动直到下回合结束或受到伤害为止。"
[A_OpportunityAttack_Buff_ReducedDamage H7BaseBuff]
mName="伺机攻击伤害修正"
[A_StrikeAndReturn_Disable H7CreatureAbility]
mName="攻击并停留"
mTooltip="该生物无法发动"攻击并退回"形式的攻击。"

[A_AuraOfPestilence_Buff H7BaseBuff]
mName="瘟疫之光"
mTooltip="%stat1 %ICON_ATTACK 攻击\n%stat2 %ICON_MAX_MOVEMENT 移动力\n持续 %durnow 回合。"

UCP MOD

[A_InkSpray H7CreatureAbility]
mName="墨汁挥溅"
mTooltip="生物对一个角度的邻近目标单位造成 %special1 伤害，目标生物在其下回合结束前有 50% 的机会错失近战攻击与反击。"

[A_CripplingSting H7CreatureAbility]
mName="致残之刺"
mTooltip="该生物发动一次近战攻击，造成 %buff1.buff.stat1 伤害且不受反击，且受到攻击的生物无法行动，直到其下回合结束。"

[A_Thorns H7CreatureAbility]
mName="荆棘遍地"
mTooltip="在一片2x2的区域内覆盖荆棘，持续 %durini 战斗回合。在荆棘区域开始回合的敌方生物 %buff1.buff.buff.buff.stat %ICON_MAX_MOVEMENT 移动力，并在移动时受到每个德鲁伊长老造成的 10 点 %ICON_EARTH %ICON_EARTH 土系伤害。"

[A_No_Meele_Penalty H7CreatureAbility]
mName="无近战惩罚"
mTooltip="此生物在近战中战斗时没有惩罚。"

[A_PiercingShot_Apprentice H7CreatureAbility]
mName="魔法射击"
mTooltip="该生物将攻击成一条直线上的所有单位，造成随机魔法学派的伤害。"

UCP 1.1 (Brand New)

[A_HolyBlades_Ability H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="神圣之刃"
mTooltip="在该生物近战攻击（非反击）目标的所有亡灵和恶魔受到其造成伤害 %special1 的 %icon_light 光系伤害。"

[A_BlessedArrows H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="祝福箭矢"
mTooltip="在士气回合，该生物的远程攻击将忽略目标单位的 %ICON_DEFENSE 防御。"

[A_BlessedArrows_Ability H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="祝福箭矢"
mTooltip=""

[A_LonelyWolf_Buff_Increase H7BaseBuff]
mName="孤狼"
mTooltip=""

[A_FormationDefensive H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="防御阵型"
mTooltip="该生物切换到防御形态：%buff1.buff.stat1 %icon_defense 防御和 %buff1.buff.stat2 %icon_health 最大生命值，此外还有其普通的 %icon_Defense 防御加成，但其 %icon_movement 移动力设置为 %buff1.buff.stat3。"

[A_FormationDefensive_Buff H7BaseBuff]
mName="防御阵型"
mTooltip="%stat1 %icon_defense 防御和 %stat2 %icon_health 最大生命值，此外还有其普通的 %icon_Defense 防御加成，但 %icon_movement 移动力设置为 %stat3。"

[A_FormationOffensive H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="进攻阵型"
mTooltip="该生物切换到进攻形态：%buff1.buff.stat1 %icon_attack 攻击和 %buff1.buff.stat2 %icon_movement 移动力，但其 %icon_defense 防御力设置为 %buff1.buff.stat3。"

[A_FormationOffensive_Buff H7BaseBuff]
mName="进攻阵型"
mTooltip="%stat1 %icon_attack 攻击和 %stat2 %icon_movement 移动力，但 %icon_defense 防御力设置为 %stat3。"

[A_Incorporeal H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="无实体"
mTooltip="任何非魔法攻击对该生物有 %d.min% 的几率失败。"

[A_Incorporeal_Buff H7BaseBuff]
mName="无实体"
mTooltip=""

[A_BarbarianAnger H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="野蛮人愤怒"
mTooltip="攻击该生物的敌方生物成为此生物愤怒的目标并被标记。拥有此能力的生物对这些被标记生物的所有攻击（不包括反击）会成为暴击，持续 %buff.buff.durini 回合。"

[A_BarbarianAnger_Buff H7BaseBuff]
mName="野蛮人愤怒目标"
mTooltip="所有拥有野蛮人愤怒能力的生物对此生物的攻击（非反击）将是暴击。持续 %durnow 回合。"

[A_CursedBlossom H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="诅咒之花"
mTooltip="近战攻击该生物的敌方生物获得 %buff.buff.stat %icon_luck 幸运，直到其下回合结束。"

[A_CursedBlossom_Buff H7BaseBuff]
mName="诅咒之花"
mTooltip="%stat %icon_luck 幸运，直到该生物下回合结束。"

[A_ShadowArmour H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="暗影护甲"
mTooltip="每当此生物被笼罩时，它获得一个护盾，吸收每英雄等级 %stat.val 伤害。"

[A_ShadowArmour_Buff H7BaseBuff]
mName="暗影护甲"
mTooltip="吸收最多 %special.val3 伤害。"

[A_SolidAsAStone H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="坚如磐石"
mTooltip="每当该生物受到伤害时，它获得 %buff.buff.stat %buff.buff.stat.icon 防御力，直到其下回合结束。"

[A_SolidAsAStone_Buff H7BaseBuff]
mName="坚如磐石"
mTooltip=""

[A_RhinocerosSkin H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="犀牛皮肤"
mTooltip="+2 %icon_defense 防御力每移动一格，直到该生物下回合结束。"

[A_RhinocerosSkin_Buff H7BaseBuff]
mName="犀牛皮肤"
mTooltip=""

[A_FlameStorm H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="火焰风暴"
mTooltip="在每个战斗回合开始时，每个敌方生物有 %buff1.buff.d.chance% 的几率受到 %buff1.buff.d.min %icon_fire 火焰伤害。"

[A_Flamestorm_Buff H7BaseBuff]
mName="火焰风暴"
mTooltip=""

[A_FlamingArrows H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="火焰箭矢"
mTooltip="被该生物远程攻击击中的大型生物将被点燃。燃烧在生物回合开始时对其造成 %buff.buff.special %ICON_Fire 火焰伤害，持续 %buff.buff.durini 回合。"

[A_FlamingArrows_Buff H7BaseBuff]
mName="燃烧"
mTooltip="在生物回合开始时对其造成 %special %ICON_Fire 火焰伤害。持续 %durnow 回合。"

[A_ChildOfTheDarkness H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="黑暗之子"
mTooltip="该生物可以穿过任何其他生物，当穿过敌方生物时，对每个组队中的单个生物造成1 %ICON_DARK 暗系伤害。"

[A_ChildOfTheDarkness_Buff H7BaseBuff]
mName="黑暗之子"
mTooltip=""

[A_Explosion H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="爆炸"
mTooltip="每当该生物受到伤害时，爆炸对所有相邻敌方生物造成 %d2.max %icon_fire 火焰伤害。"

[A_WindShield H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="风之护盾"
mTooltip="该生物免疫每次战斗中受到的第一次伤害。"

[A_WindShield_Buff H7BaseBuff]
mName="风之护盾"
mTooltip="该生物免疫每次战斗中受到的第一次伤害。"

[A_AuraOfRenewal H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="复苏光环"
mTooltip="该生物和所有相邻本方生物在此生物回合开始时回复 %d1.min 生命值。\n（亡灵体和构造体不受影响）"

[A_IcePrison_Attack H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="冰狱"
mTooltip="此生物的远程攻击有 %d2.min% 的几率囚禁目标敌方生物。被囚禁的生物无法行动，被视为不存在，直到下个战斗回合开始。"

[A_IcePrison_Buff H7BaseBuff]
mName="冰狱"
mTooltip="冰狱中的生物无法行动，被视为不存在，直到下个战斗回合开始。"

[A_TouchOfLight H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="光之触"
mTooltip="该生物移动到目标本方生物处，移除其所有负面魔法效果并完全回复其 %icon_health 生命值。"

[A_ShadowOfDeath H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="死亡暗影"
mTooltip="被攻击的生物获得 %buff.buff.stat %icon_health 生命值，持续 %buff.buff.durini 回合（不可叠加）。"

[A_ShadowOfDeath_Buff H7BaseBuff]
mName="死亡暗影"
mTooltip="%stat %icon_health 生命值，持续 %durnow 回合。"

[A_SirenSong H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="塞壬之歌"
mTooltip="近战攻击该生物的敌方生物被魅惑，直到其下回合结束。该生物免疫被魅惑生物造成的伤害。\n生物不能被连续魅惑两次。\n（亡灵体和构造体不受影响）"

[A_SirenSong_Buff H7BaseBuff]
mName="被魅惑"
mTooltip="此生物对拥有塞壬之歌能力的生物不造成伤害。效果持续到该生物下回合结束。"

[A_SoulReaver_Buff H7BaseBuff]
mName="攫魂使者"
mTooltip=""

[A_DivingAttack_Initiative_Buff H7BaseBuff]
mName="抵达"
mTooltip="%stat1.icon 主动性设置为 %stat1 且该生物无法使用俯冲攻击，持续 %durnow 回合。"

UCP 1.1 (Improved descriptions)

[A_Regeneration_Wyvern H7CreatureAbility]
mName="活力再生"
mTooltip="该生物在回合结束时回复并复活 %d.min 生命值。"

[A_Splash H7CreatureAbility]
mName="溅射伤害"
mTooltip="该生物对目标 3x3 区域射击一次，每场战斗一次。目标生物获得 %buff.buff.stat1 %icon_Movement 移动力和 %buff.buff.stat2 %ICON_INITIATIVE 主动性，直到其下回合结束。该生物在近战攻击时无法使用。"

[A_Splash_Buff H7BaseBuff]
mName="溅射伤害"
mTooltip="%stat1 %icon_Movement 移动力和 %stat2 %icon_Initiative 主动性，直到该生物下回合结束。"

[A_SoulReaver H7CreatureAbility]
mName="攫魂使者"
mTooltip="在此生物每个回合开始时，你的英雄为每个相邻的活着的敌方生物获得 %buff1.buff.stat1 %ICON_MANA 法力。"

[A_DivingAttack_Buff_Movement H7BaseBuff]
mTooltip=""

[A_DivingAttack_Buff H7BaseBuff]
mName=""

[A_SolderingHands H7CreatureAbility]
mName="徒手焊接"
mTooltip="立即修复相邻友方构造体 %d.min 生命值。"

[A_LifeDrain H7CreatureAbility]
mName="生命汲取"
mTooltip="该生物的攻击能回复等于此次对主要目标伤害值一半的生命值，该回复也可以复活已经阵亡的生物。\n该生物无法从亡灵体和构造体处获得生命值。"

[A_StrikeAndReturn H7CreatureAbility]
mName="攻击并退回"
mTooltip="如果初始位置仍然可达，该生物在攻击后返回其初始位置。"

[A_RuneOfBalance_Ability_Active H7RuneAbility]
mName="平衡符文：激活"
mTooltip="移除光环内所有生物的增益效果。每场战斗可激活一次。"

[A_Nova H7CreatureAbility]
mName="魔力新星"
mTooltip="该生物对目标 3x3 区域射击一次，每场战斗一次。该生物在近战攻击时无法使用。"

[A_FireNova H7CreatureAbility]
mName="魔力新星"
mTooltip="该生物对目标 3x3 区域射击一次，每场战斗一次。该生物在近战攻击时无法使用。"

[A_LivingShelter_Buff_Treant H7BaseBuff]
mName="生命庇护"
mTooltip="%stat1 %ICON_DEFENSE 防御\n该生物为本方生物提供庇护，它们可以穿过它。任何对相邻友方单位造成的非魔法伤害被重定向到此生物。持续到该生物移动或攻击。"

[A_LivingShelter H7CreatureAbility]
mName="生命庇护"
mTooltip="该生物获得 %stat %ICON_DEFENSE 防御并为本方生物提供庇护。友方生物可以穿过它，任何对它们造成的非魔法伤害被重定向到此生物。%name 持续到该生物移动或攻击。"

[A_LivingShelter_Buff_Allies H7BaseBuff]
mName="树盾"
mTooltip="提供对远程攻击的掩护。任何对此生物造成的非魔法伤害被重定向到使用生命庇护能力的相邻生物。"

[A_AuraOfPestilence_Buff_Damage H7BaseBuff]
mName="瘟疫之光"
mTooltip=""

[A_AuraOfPestilence H7CreatureAbility]
mName="瘟疫之光"
mTooltip="相邻生物在每个战斗回合结束时受到 %d.min %ICON_EARTH 土系毒性伤害，并获得 %buff.buff.buff.buff.stat1 %ICON_ATTACK 攻击和 %buff.buff.buff.buff.stat2 %ICON_MAX_MOVEMENT 移动力，持续 %buff.buff.buff.buff.durini 回合。\n（亡灵体和构造体不受影响）"

[A_DivingAttack H7CreatureAbility]
mName="俯冲攻击"
mTooltip="该生物升空并攻击目标 2x2 区域内的所有生物，攻击力为 %buff1.buff.stat %ICON_ATTACK 攻击。该攻击无法被反击。之后该生物降落在目标区域附近。\n此生物的 %icon_initiative 主动性设置为 %buff1.buff.buff.buff.stat1 且无法使用 %name，直到其下回合结束。"

[A_Rooting_Buff_Base H7BaseBuff]
mName="盘根错节"
mTooltip="%stat %ICON_MAX_MOVEMENT 移动力，持续 %durnow 回合。"

[A_Rooting_Buff_Critical H7BaseBuff]
mName="致命盘根错节"
mTooltip="该生物无法移动和使用基于移动的能力，持续 %durnow 回合。"

[A_Rooting H7CreatureAbility]
mName="盘根错节"
mTooltip="被攻击生物获得 %buff1.buff.stat %ICON_MAX_MOVEMENT 移动力，持续 %buff1.buff.durini 回合。\n被暴击生物改为无法移动和使用基于移动的能力，直到其下回合结束。"

[A_RuneOfBalance_Ability_Aura_5x5 H7RuneAbility]
mName="平衡符文：光环"
mTooltip="光环内友方生物受到的所有非魔法伤害将在光环内所有友方生物之间平均分配。"

[A_RuneOfBalance_CreatureAbility_5x5 H7CreatureAbility]
mName="平衡符文"
mTooltip="该生物周围 5x5 区域内友方生物受到的所有非魔法伤害将在该区域内所有友方生物之间平均分配。"

[A_RuneOfBalance_Ability_Aura_3x3 H7RuneAbility]
mName="平衡符文：光环"
mTooltip="光环内友方生物受到的所有非魔法伤害将在光环内所有友方生物之间平均分配。"

[A_RuneOfBalance_Ability_Aura_Buff H7BaseBuff]
mName="平衡符文光环"
mTooltip="对该生物造成的所有非魔法伤害将在平衡符文光环内的所有友方生物之间平均分配。"

[A_RuneOfBalance_CreatureAbility_3x3 H7CreatureAbility]
mName="平衡符文"
mTooltip="该生物周围 3x3 区域内友方生物受到的所有非魔法伤害将在该区域内所有友方生物之间平均分配。"

[A_OpportunityAttack H7CreatureAbility]
mName="伺机攻击"
mTooltip="如果该生物不处于近战状态，它在每个战斗回合中对第一个被近战攻击的敌方生物获得一次免费的立即射击。此免费射击造成-50%更少伤害。"

[A_AcidBreath H7CreatureAbility]
mName="酸性吐息"
mTooltip="该生物在其攻击（非反击）期间向敌方单位喷出酸雾。此伤害不应用侧击。\n被攻击生物在其下一回合受到攻击伤害的一半，再下一回合受到25%。"

[A_DragonAcidBreath H7CreatureAbility]
mName="酸性龙息"
mTooltip="该生物在其攻击（非反击）期间向被攻击单位方向喷出酸雾。此伤害不应用侧击。\n被攻击生物在其下一回合受到攻击伤害的一半，再下一回合受到25%。"

[A_BreathOfLight H7CreatureAbility]
mName="光龙吐息"
mTooltip="该生物在其攻击（非反击）期间向敌方单位施放光线。此伤害不应用侧击。\n被暴击生物无法行动，直到其下回合结束。"

[A_WitheringBreath H7CreatureAbility]
mName="虚枯吐息"
mTooltip="该生物在其攻击（非反击）期间向敌方单位喷出暗系魔法雾。此伤害不应用侧击。\n被攻击生物在其下一回合受到攻击伤害的一半，再下一回合受到25%。"

[A_FireBreath H7CreatureAbility]
mName="烈焰吐息"
mTooltip="该生物在其攻击（非反击）期间向敌方单位喷出火系魔法。此伤害不应用侧击。\n被击中的格子被点燃，直到下个战斗回合结束。在燃烧格子上开始回合或踏上格子的生物受到 %buff1.buff.d1.min %buff1.buff.d1.icon 火焰伤害。"

UCP 1.2

[A_ScatterShot H7CreatureAbility]
mName="散射"
mTooltip="该生物攻击目标 4x4 区域内的所有单位，造成25%伤害。"

[A_LongRange_Buff H7BaseBuff]
mName="长程攻击"

[A_SHIELDING H7CreatureAbility]
mName="盾防御"
mTooltip="相邻友方生物（除了军团士兵）仅受到近战和远程攻击25%的伤害，而军团士兵也承受25%的伤害。"

[A_OpportunityRetaliation H7CreatureAbility]
mName="伺机反击"
mTooltip="该生物对攻击友方生物的相邻敌方生物获得一次免费反击。此能力只能在每个生物回合激活一次，条件是攻击目标存活。"

[A_WindShield_NotUsed_Buff H7BaseBuff]
mName="风之护盾"
mTooltip="该生物免疫每次战斗中受到的第一次伤害。"

[A_LifeDrain_LustForBlood H7CreatureAbility]
mName="生命汲取"
mTooltip="该生物的攻击能回复等于此次对主要目标伤害值10%的生命值，该回复也可以复活已经阵亡的生物。\n该生物无法从亡灵体和构造体处获得生命值。"

[A_MagicCatalyst H7CreatureAbility]
mName="魔力催化"
mTooltip="所有相邻敌方生物从法术（除了源力魔法）受到额外 %buff1.buff.res1.norm 直接伤害。"

[A_MagicCatalyst_Buff H7BaseBuff]
mName="魔力催化"
mTooltip="该生物从法术（除了源力魔法）受到额外 %res1.norm 直接伤害。"

[A_GiftOfLife_Buff_Marker H7BaseBuff]
mName="生命馈赠"

[A_ShieldProtection H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="盾牌保护"
mTooltip="此生物和所有相邻友方生物获得对远程攻击的掩护。"

[A_ShieldProtection_Buff H7BaseBuff]
mName="盾牌保护"
mTooltip="该生物获得对远程攻击的掩护。"

[A_ArdentAura_Buff H7BaseBuff]
mName="炽热光环"
mTooltip="火系易伤：该生物受到25%更多 %icon_fire 火焰伤害。"

[A_ArdentAura H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="炽热光环"
mTooltip="所有相邻敌方生物对火系易伤。"

[A_Contagion H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="传染"
mTooltip="该生物的瘟疫之光光环变得具有传染性，在受感染目标回合开始时从它们传播到相邻的活着的生物。"

[A_GriffinResolve H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="狮鹫决心"
mTooltip="此生物的每次攻击或反击增加其 %icon_attack 攻击力+%buff.buff.stat.norm，持续 %buff.buff.durini 回合。"

[A_GriffinResolve_Buff H7BaseBuff]
mName="狮鹫决心"
mTooltip=""

UCP 1.3 modified

[A_HexOfDisruption H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="解离大法"
mTooltip="该生物的远程攻击减少目标生物和其周围所有敌方生物的 %ICON_DEFENSE 防御力 %buff.buff.buff1.buff.stat.norm，持续 %buff.buff.buff1.buff.durini 回合。"

[A_HexOfDisruption_Primary_Buff H7BaseBuff]
mName="解离大法"

[A_LivingShelter H7CreatureAbility]
mName="生命庇护"
mTooltip="只要此生物在其初始位置，相邻友方生物（除了树精和远古树精）获得对远程攻击的掩护和 %buff1.buff.stat1 %ICON_DEFENSE 防御力。"

[A_LivingShelter_Ability H7CreatureAbility]
mName="生命庇护"

[A_LivingShelter_Buff_Allies H7BaseBuff]
mName="生命庇护"
mTooltip="该生物获得对远程攻击的掩护和 %stat1 %stat1.icon 防御力。"

[A_Cleave H7CreatureAbility]
mName="顺势斩"
mTooltip="该生物总是攻击两次（除了反击）。被攻击生物在第一次攻击后有机会反击。"

[A_GiftOfLife H7CreatureAbility]
mName="生命馈赠"
mTooltip="树精之母的复苏除了回复外还能复活林妖。所有其他对友方生物的治疗或回复效果也将复制到此生物上。"

[A_RuneOfBalance H7CreatureAbility]
mName="平衡符文"
mTooltip="控制玩家可以部署平衡符文。它有一个3x3光环，将光环内一个友方生物受到的所有非魔法伤害分配给光环内所有友方生物。区域内的生物也受到保护，免受%spell效果的影响。\n每场战斗一次，符文可以移除其光环内所有生物的增益效果。"

[A_SoulFlayingBreath H7CreatureAbility]
mName="剥魂吐息"
mTooltip="该生物在其攻击（非反击）期间向敌方单位喷出暗系魔法射线，伤害特定角度内的所有单位。此伤害不应用侧击。\n被攻击生物还失去两个正面效果。"

UCP 1.3 new

[A_TimeLord H7CreatureAbility]
mName="时间领主"
mTooltip="相邻友方生物在此能力使用后获得 %buff1.buff.stat1 %ICON_INITIATIVE 主动性，持续 %buff1.buff.durini 回合。"

[A_TimeLord_Buff H7BaseBuff]
mName="时间领主"
mTooltip="%stat1 %stat1.icon 主动性，持续 %durnow 回合。"

[A_MarkOfTiger H7CreatureAbility]
mName="猛虎标记"
mTooltip="近战攻击该生物的敌方生物获得猛虎标记。\n每当该生物反击时，所有被标记生物受到等于反击造成伤害的额外伤害，在所有被标记生物之间平均分配。"

[A_MarkOfTiger_Buff H7BaseBuff]
mName="猛虎标记"
mTooltip="当敌方生物使用猛虎标记能力反击时，此生物将受到伤害。"

[A_MarkOfTiger_MainTarget_Buff H7BaseBuff]
mName="猛虎标记"
mTooltip="当敌方生物使用猛虎标记能力反击时，此生物将受到伤害。"

[A_LastKiss H7CreatureAbility]
mName="最后一吻"
mTooltip="如果该生物用其远程攻击杀死一个敌人，其下一次攻击总是暴击，持续到其下回合结束。"

[A_LastKiss_Buff H7BaseBuff]
mName="最后一吻"

[A_LastKiss_Used_Marker H7BaseBuff]
mName="最后一吻"

[A_RuneOfBalance_Ability_Active_5x5 H7RuneAbility]
mName="平衡符文：激活"
mTooltip="移除光环内所有生物的增益效果。每场战斗可激活一次。"

[A_FieryShot H7CreatureAbility]
mName="火焰射击"
mTooltip="此生物的远程攻击可以对小型敌方生物的小型（2x2）区域造成伤害。"

__________________________

v1.30

[A_DemonicLineage H7CreatureAbility]
mName="恶魔血统"
mTooltip="火系抗性：火系法术和效果伤害减半，敌人造成的火系攻击伤害减少25%。\n光系易伤：该生物受到25%更多光系伤害。\n恶魔生物在友方单位被摧毁时不会遭受士气 %icon_morale 惩罚。"

v1.37 

[A_LonelyWolf H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="孤狼"
mTooltip="%buff.buff.stat1 %icon_health 生命值和 %buff.buff.stat3 %icon_movement 移动力当该生物没有相邻友方时。"

[A_StunningBlow H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="震撼打击"
mTooltip="该生物的每次攻击有 %buff.chance % 的几率减少目标的魔法抗性至 %buff.buff.res，持续 %buff.buff.durini 回合。"

[A_StunningBlow_Buff H7BaseBuff]
mName="震撼打击"
mTooltip="%res 魔法抗性，持续 %durnow 回合。"